{
  "pipeline": "pipeline",
  "configuePipeline": "Configura pipeline",
  "createPipeline": "Crea pipeline",
  "deletePipeline": "Elimina pipeline",
  "dbzServerButton": "Configurazione server DBZ",
  "debeziumServerModal": {
    "title": "Crea risorse pipeline utilizzando la configurazione del server Debezium",
    "description": "Carica un file di configurazione del server Debezium per creare automaticamente le risorse della pipeline. Caricando un file di configurazione verranno creati un'origine, trasformazioni e una destinazione in modo sincrono in base alla configurazione caricata e infine potrai creare una pipeline utilizzando queste risorse.",
    "acceptedFiles": "Tipi di file accettati: {{val}}",
    "dragAndDrop": "Trascina e rilascia i file qui",
    "creatingResource": "Creazione di un connettore {{val}}...",
    "creatingTransform": "Creazione delle trasformazioni...",
    "nonSupportedFilesHeader": "File non supportato",
    "nonSupportedFilesMsg": "{{val}} non sono tipi di file accettati."
  },
  "dbzServerTooltip": "Carica la configurazione del server DBZ per creare una nuova origine, trasformazioni e destinazione per una pipeline.",
  "userActions": {
    "overview": "Panoramica",
    "logs": "Visualizza log",
    "download": "Scarica log",
    "actions": "Azioni",
    "edit": "Modifica",
    "delete": "Elimina"
  },
  "pipelinePage": {
    "description": "Visualizza e gestisci le tue pipeline configurate. Puoi anche creare una nuova pipeline per trasmettere eventi di modifica da un database di origine.",
    "title": "Pipeline",
    "phase": "Fase",
    "Enabled": "Abilitato",
    "Actions": "Azioni",
    "welcomeTitle": "Benvenuto in Stage",
    "welcomeDescription": "L'interfaccia Stage fornisce uno strumento visivo per configurare e operare con pipeline di dati in cui puoi definire l'origine, la destinazione e qualsiasi trasformazione dei dati.",
    "welcomeDescriptionSufix": "Aggiungi una pipeline per trasmettere eventi di modifica da un database di origine della pipeline. Per creare una pipeline, puoi selezionare un'origine e una destinazione già configurate o aggiungerne di nuove.",
    "welcomeButtom": "Crea la tua prima pipeline",
    "designerTitle": "Progettista di pipeline",
    "designerDescription": "Crea una pipeline selezionando un'origine e una destinazione esistenti o creandone di nuove se necessario. Puoi opzionalmente aggiungere una o più trasformazioni da applicare alla pipeline."
  },
  "transformDrawer": {
    "description": "Elenco delle trasformazioni da applicare alla pipeline. Puoi eliminarle o riordinarle in un ordine specifico per applicarle.",
    "title": "Elenco trasformazioni",
    "emptyState": "Nessuna trasformazione aggiunta alla pipeline"
  },
  "form": {
    "title": "Configurazione della pipeline",
    "description": "Per configurare e creare una pipeline di dati, compila il modulo sottostante o utilizza l'editor intelligente per configurare una nuova pipeline di dati. Se hai già un file di configurazione, puoi configurare una nuova pipeline di dati caricandolo nell'editor intelligente.",
    "nameField": "Nome della pipeline",
    "descriptionField": "Descrizione",
    "descriptionFieldHelperText": "Aggiungi una breve descrizione per la tua pipeline o per ciò che intendi catturare.",
    "subsectionTitle": "Proprietà di configurazione",
    "logLevelField": "Livello di log",
    "flowField": "Flusso della pipeline"
  },
  "tabs": {
    "overview": "Panoramica",
    "log": "Log della pipeline",
    "edit": "Modifica pipeline",
    "action": "Azione pipeline"
  },
  "overview": {
    "description": "Panoramica della pipeline per {{val}} con elenco di metriche essenziali, dettagli sulla composizione (origine e destinazione), log della pipeline e opzione per modificare la pipeline.",
    "title": "Panoramica della pipeline",
    "updatePipeline": "Aggiorna pipeline",
    "pipelineComposition": "Composizione della pipeline",
    "queueUsage": "Utilizzo della coda",
    "events": "Eventi"
  },
  "actions": {
    "title": "Azioni pipeline",
    "description": "Usa i segnali per eseguire azioni sulla pipeline.",
    "actionField": "Azione",
    "actionTypeField": "Tipo di azione",
    "messageField": "Messaggio",
    "collectionField": "Nome della collezione",
    "collectionFieldDescription": "Un componente richiesto del campo dati di un segnale che specifica un array di nomi di collezioni o espressioni regolari per abbinare i nomi delle collezioni da includere nello snapshot.",
    "messageFieldDescription": "Il parametro del messaggio specifica la stringa da stampare nel log. Se aggiungi un segnaposto ({ }), viene sostituito con le coordinate di streaming.",
    "selectAnAction": "Seleziona un'azione",
    "actionTypeFieldDescription": "Specifica il tipo di parametro che indica l'operazione che il segnale è destinato a innescare.",
    "actionIdHelper": "È precompilato con una stringa UUID, l'utente può anche aggiornarlo per fornire il proprio ID.",
    "addFilter": "Aggiungi filtro",
    "filterCondition": "Condizione del filtro {{val}}",
    "filterConditionFields": {
      "filtersField": "Filtri",
      "filtersHelperText": "Specifica i valori delle colonne che devono essere presenti in un record di raccolta dati affinché lo snapshot lo includa.",
      "collectionsField": "Nome della collezione",
      "collectionsHelperText": "Il nome completamente qualificato della raccolta dati per cui verrà applicato il filtro."
    },
    "additionalConditions": "Condizioni aggiuntive",
    "additioanlConditionsDesc": "Condizioni aggiuntive che il connettore valuta per determinare il sottoinsieme di record da includere in uno snapshot."
  },
  "logs": {
    "download": "Scarica file di log",
    "fullScreen": "Schermo intero",
    "notification": {
      "grepNotification": "Notifiche grep",
      "showTooltip": "Clicca per grep i log delle notifiche.",
      "hideTooltip": "Clicca per interrompere grep i log delle notifiche."
    }
  }
}