{
    "source": "Fonte",
    "page": {
        "description": "Elenca le fonti disponibili configurate nel cluster che trasmettono eventi di modifica da un database di origine. Puoi cercare una fonte per nome o ordinare l’elenco in base al numero di pipeline attive che la utilizzano."
    },
    "create": {
        "title": "Crea fonte",
        "description": "Per configurare e creare un connettore, compila il modulo sottostante oppure utilizza l’editor intelligente per configurare una nuova fonte. Se hai già un file di configurazione, puoi configurare una nuova fonte caricandolo nell’editor intelligente.",
        "editorPageDescription": "Per configurare e creare un nuovo connettore sorgente, utilizzare l'editor sottostante per aggiungere o caricare una configurazione JSON esistente."
    },
    "catalog": {
        "title": "Catalogo fonti",
        "description": "Seleziona il tipo di fonte che vuoi connettere dall’elenco sottostante. Una volta selezionato un connettore, puoi configurarlo usando l’editor modulo o l’editor intelligente. Puoi anche cercare il connettore per nome o passare dalla vista elenco alla vista a schede.",
        "backToCatalog": "Torna al catalogo",
        "rawEditorDescription": "Utilizzalo per creare un {{val}} direttamente dal json."
    },
    "edit": {
        "title": "Modifica fonte",
        "description": "Modifica i dettagli del connettore di origine utilizzando il modulo sottostante o l'editor intelligente."
    },
    "signal": {
        "title": "Abilita il signaling",
        "description": "Per abilitare la funzionalità di signaling, imposta il nome della collezione di signaling e conferma che il DDL del database sia stato eseguito.",
        "modelDescription": "Devi creare la collezione di dati di signaling sul database di origine, designata esclusivamente per l'invio di segnali a Debezium. La collezione di dati di signaling deve essere unica per ogni istanza del connettore.",
        "setupSignaling": "Configura il signaling",
        "signalingCollectionField": {
            "label": "Nome della collezione di signaling",
            "helper": "Il valore inserito sarà suffisso con '{{val}}' per creare la collezione di signaling sul database di origine."
        },
        "ddlQuery": "Query DDL",
        "errorMsg": "Si prega di compilare i campi {{val}} nelle proprietà di configurazione del connettore."
    }
}