{
    "source": "source",
    "page": {
        "description": "View the available sources configured to stream change events from source databases. You can search by name or sort the list by the number of active pipelines using each source."
    },
    "create": {
        "title": "Create source",
        "description": "To create a source connector, fill out the form below or use the Smart Editor. In the Smart Editor, you can also directly use the configuration for a Debezium connector on Kafka Connect or in Debezium Server, as it automatically converts the configuration into the required Debezium Platform format.",
        "editorPageDescription": "To configure and create a new source connector, use the editor below to add or upload an existing JSON configuration. You can also directly use the configuration for a Debezium connector on Kafka Connect or in Debezium Server, as the Smart Editor automatically converts it into the required Debezium Platform format.",
        "dataTableDescription": "Select the data table to be targeted for sync",
        "dataTableTitle": "{{val}} data table"
    },
    "catalog": {
        "title": "Source catalog",
        "description": "Select the type of source you want to connect from the list below, once you select a connector you can configure it using form or smart editor option. You can also search the connector by its name or toggle the catalog between the list view or card view.",
        "backToCatalog": "Back to catalog",
        "rawEditorDescription": "Use this to create a {{val}} direclty form the json."
    },
    "edit": {
        "title": "Edit source",
        "description": "Edit the source connector details using the below form or smart editor."
    },
    "signal": {
        "title": "Enable signalling",
        "description": "To enable the signaling capability, set the Signaling collection name and confirm that databse DDL has ben execulted.",
        "modelDescription": "You need to create the signaling data collection on the source database, its designated exclusively for sending signals to Debezium. The signaling data collection must be unique to each connector instance.",
        "setupSignaling": "Setup signaling",
        "signalingCollectionField": {
            "label": "Signaling collection name",
            "helper": "Entered value will be suffixed with '{{val}}' to create signaling collection on the source database."
        },
        "ddlQuery": "DDL query",
        "errorMsg": "Please fill out the {{val}} fields in the connector configuration properties."
    }
}