{
    "source": "source",
    "page": {
        "description": "Lists the available sources configured in the cluster streaming change events from a source database. You can search a source by its name or sort the list by the count of active pipelines using a source."
    },
    "create": {
        "title": "Create source",
        "description": "To create a source connector, fill out the form below or use the Smart editor. If you have a configuration file, upload it in the editor to set up the connector. Kafka Connect format is also supported and can be auto-converted to the Debezium Platform format within the editor.",
        "editorPageDescription": "To configure and create a new source connector use the editor below to add or upload an existing json configuration."
    },
    "catalog": {
        "title": "Source catalog",
        "description": "Select the type of source you want to connect from the list below, once you select a connector you can configure it using form or smart editor option. You can also search the connector by its name or toggle the catalog between the list view or card view.",
        "backToCatalog": "Back to catalog",
        "rawEditorDescription": "Use this to create a {{val}} direclty form the json."
    },
    "edit": {
        "title": "Edit source",
        "description": "To configure and create a connector fill out the below form or use the smart editor to setup a new source connector. If you already have a configuration file, you can setup a new source connector by uploading it in the smart editor."
    },
    "signal": {
        "title": "Enable signalling",
        "description": "To enable the signaling capability, set the Signaling collection name and confirm that databse DDL has ben execulted.",
        "modelDescription": "You need to create the signaling data collection on the source database, its designated exclusively for sending signals to Debezium. The signaling data collection must be unique to each connector instance.",
        "setupSignaling": "Setup signaling",
        "signalingCollectionField": {
            "label": "Signaling collection name",
            "helper": "Entered value will be suffixed with '{{val}}' to create signaling collection on the source database."
        },
        "ddlQuery": "DDL query",
        "errorMsg": "Please fill out the {{val}} fields in the connector configuration properties."
    }
}